{
  "title": "Clawdbot y la Ilusi贸n de la Privacidad: Riesgos Cr铆ticos del RGPD",
  "description": "An谩lisis cr铆tico de la arquitectura de Clawdbot y sus implicaciones legales: responsabilidad del tratamiento, incumplimientos espec铆ficos del RGPD y conclusiones operativas.",
  "datePublished": "2026-01-27",
  "author": "Ricardo Scarpa",
  "body": "> \"Si conectas Clawdbot a OpenAI o Anthropic... tus datos siguen yendo a la nube, punto\"\n\n## Introducci贸n\n\nEste an谩lisis examina la promesa de privacidad asociada a arquitecturas de IA autoalojadas como Clawdbot. Aunque se publicitan como soluciones que evitan la exposici贸n de datos, la integraci贸n con modelos externos y servicios de inferencia en la nube introduce flujos de datos que pueden desvirtuar dicha promesa. La cuesti贸n central no es la localizaci贸n del ejecutable, sino el control efectivo sobre el tratamiento y las transferencias.\n\nLa arquitectura t茅cnica condiciona el reparto de responsabilidades. Cuando el sistema decide qu茅 datos se env铆an a terceros, cu谩ndo se consultan APIs externas y c贸mo se agregan resultados, se configura una posici贸n jur铆dica concreta frente al RGPD que no puede ignorarse.\n\n## El Usuario como Responsable\n\nSi el usuario configura, decide finalidades y determina los medios esenciales del tratamiento, asume el rol de Responsable del Tratamiento. En arquitecturas como Clawdbot, la elecci贸n de proveedores de inferencia (OpenAI, Anthropic u otros), la activaci贸n de herramientas con acceso a informaci贸n sensible y la parametrizaci贸n de prompts que arrastran datos personales sit煤an al usuario en el centro de la decisi贸n.\n\nQuien integra el sistema para realizar tareas sobre datos de clientes, empleados o expedientes, determina finalidades y medios. La responsabilidad no se desplaza al proveedor externo por el mero hecho de usar su API. En t茅rminos pr谩cticos, esto obliga a realizar an谩lisis de riesgos, firmar acuerdos de encargo cuando proceda y documentar decisiones t茅cnicas con impacto en los derechos.\n\n## Incumplimientos Espec铆ficos\n\n- Base jur铆dica insuficiente para env铆os a terceros pa铆ses cuando se usan proveedores con transferencia internacional sin garant铆as adecuadas.\n- Falta de informaci贸n clara al interesado sobre el uso de sistemas de IA con llamadas externas y generaci贸n de perfiles.\n- Ausencia de medidas de minimizaci贸n al enviar prompts con datos excesivos o documentos completos para tareas no estrictamente necesarias.\n- Evaluaciones de impacto ausentes en casos de alto riesgo, especialmente cuando se automatizan decisiones o se tratan categor铆as especiales.\n- Trazabilidad deficiente de las operaciones y ausencia de registros que acrediten cumplimiento y supervisi贸n humana efectiva.\n\nLa falsa sensaci贸n de privacidad se produce cuando se confunde \"autoalojado\" con \"autocontenido\". La conexi贸n a modelos externos implica tratamiento por terceros, potencial transferencia internacional y obligaciones de diligencia reforzada.\n\n## Conclusi贸n\n\nLa arquitectura de Clawdbot puede convertir al usuario en Responsable del Tratamiento, con la consiguiente asunci贸n de obligaciones y exposici贸n sancionadora. La clave es gobernar el flujo de datos, limitar integraciones externas y documentar el cumplimiento. La privacidad no se garantiza por el simple hecho de instalar un software local, sino por decisiones t茅cnicas y organizativas verificables.\n\n[ Descargar Informe T茅cnico Completo (PDF - 7 p谩gs)](/assets/docs/informe-clawdbot-rgpd.pdf)",
  "url": "https://derechoartificial.com/firma-scarpa/clawdbot-ilusion-privacidad"
}